Enums/ВидыСчетовРеглУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыСчетовРеглУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыручкаОтПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыручкаОтПродажКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСпоПриобретеннымЦенностям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПриДоходах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПриЗакупке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПриОтгрузкеБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПриПродаже</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПриПродажеКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыМЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоВознаграждению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоПодарочнымСертификатам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоПретензиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентамиТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщиками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщикамиТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьПродажКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТМЦВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТМЦВЭксплуатацииЗаБалансом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеРасходовОСНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивыПассивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеРасходовЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСчетовРеглУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает список видов счетов, применяющихся для счетов "ГруппыФинансовогоУчетаНоменклатуры" и "ПорядокОтраженияНоменклатуры"
// Возвращаемое значение:
//	Массив - массив значений типа ПеречислениеСсылка.ВидыСчетовРеглУчета;
//
Функция ВидыСчетовНоменклатуры() Экспорт
	
	ВидыСчетовНоменклатуры = Новый Массив;
	ВидыСчетовНоменклатуры.Добавить(Перечисления.ВидыСчетовРеглУчета.НаСкладе);
	ВидыСчетовНоменклатуры.Добавить(Перечисления.ВидыСчетовРеглУчета.ВыручкаОтПродаж);
	ВидыСчетовНоменклатуры.Добавить(Перечисления.ВидыСчетовРеглУчета.СебестоимостьПродаж);
	ВидыСчетовНоменклатуры.Добавить(Перечисления.ВидыСчетовРеглУчета.НДСПриПродаже);
	ВидыСчетовНоменклатуры.Добавить(Перечисления.ВидыСчетовРеглУчета.РеализацияБезПереходаПраваСобственности);
	ВидыСчетовНоменклатуры.Добавить(Перечисления.ВидыСчетовРеглУчета.НДСПриОтгрузкеБезПереходаПраваСобственности);
	Возврат ВидыСчетовНоменклатуры;
	
КонецФункции

// Возвращает список видов счетов, применяющихся для счетов "ГруппыФинансовогоУчетаНоменклатуры" и "ПорядокОтраженияНоменклатурыПереданнойНаКомиссию"
// Возвращаемое значение:
//	Массив - массив значений типа ПеречислениеСсылка.ВидыСчетовРеглУчета;
//
Функция ВидыСчетовНоменклатурыПереданнойНаКомиссию() Экспорт
	
	ВидыСчетовНоменклатурыПереданнойНаКомиссию = Новый Массив;
	Возврат ВидыСчетовНоменклатурыПереданнойНаКомиссию;
	
КонецФункции

// Возвращает список видов счетов, применяющихся для счетов "ГруппыФинансовогоУчетаРасчетов" и "ПорядокОтраженияРасчетовСПартнерами"
// Возвращаемое значение:
//	Массив - массив значений типа ПеречислениеСсылка.ВидыСчетовРеглУчета;
//
Функция ВидыСчетовРасчетовСПартнерами() Экспорт
	
	ВидыСчетовРасчетовСПартнерами = Новый Массив;
	ВидыСчетовРасчетовСПартнерами.Добавить(Перечисления.ВидыСчетовРеглУчета.РасчетыСКлиентами);
	ВидыСчетовРасчетовСПартнерами.Добавить(Перечисления.ВидыСчетовРеглУчета.АвансыПолученные);
	ВидыСчетовРасчетовСПартнерами.Добавить(Перечисления.ВидыСчетовРеглУчета.РасчетыПоВознаграждению);
	ВидыСчетовРасчетовСПартнерами.Добавить(Перечисления.ВидыСчетовРеглУчета.РасчетыСКлиентамиТара);
	ВидыСчетовРасчетовСПартнерами.Добавить(Перечисления.ВидыСчетовРеглУчета.РасчетыСПоставщиками);
	ВидыСчетовРасчетовСПартнерами.Добавить(Перечисления.ВидыСчетовРеглУчета.АвансыВыданные);
	ВидыСчетовРасчетовСПартнерами.Добавить(Перечисления.ВидыСчетовРеглУчета.РасчетыПоПретензиям);
	ВидыСчетовРасчетовСПартнерами.Добавить(Перечисления.ВидыСчетовРеглУчета.РасчетыСПоставщикамиТара);
	Возврат ВидыСчетовРасчетовСПартнерами;
	
КонецФункции

// Возвращает список видов счетов, применяющихся для счетов "СтатьиДоходов" и "ПорядокОтраженияДоходов"
// Возвращаемое значение:
//	Массив - массив значений типа ПеречислениеСсылка.ВидыСчетовРеглУчета;
//
Функция ВидыСчетовДоходов() Экспорт
	
	ВидыСчетовДоходов = Новый Массив;
	ВидыСчетовДоходов.Добавить(Перечисления.ВидыСчетовРеглУчета.Доходы);
	Возврат ВидыСчетовДоходов;
	
КонецФункции

// Возвращает список видов счетов, применяющихся для счетов "СтатьиРасходов" и "ПорядокОтраженияРасходов"
// Возвращаемое значение:
//	Массив - массив значений типа ПеречислениеСсылка.ВидыСчетовРеглУчета;
//
Функция ВидыСчетовРасходов() Экспорт
	
	ВидыСчетовРасходов = Новый Массив;
	ВидыСчетовРасходов.Добавить(Перечисления.ВидыСчетовРеглУчета.Расходы);
	ВидыСчетовРасходов.Добавить(Перечисления.ВидыСчетовРеглУчета.СписаниеРасходовОСНО);
	ВидыСчетовРасходов.Добавить(Перечисления.ВидыСчетовРеглУчета.СписаниеРасходовЕНВД);
	Возврат ВидыСчетовРасходов;
	
КонецФункции

// Возвращает список видов счетов, применяющихся для счетов "БанковскиеСчетаОрганизаций" и "Кассы"
// Возвращаемое значение:
//	Массив - массив значений типа ПеречислениеСсылка.ВидыСчетовРеглУчета;
//
Функция ВидыСчетовДенежныхСредств() Экспорт
	
	ВидыСчетовДенежныхСредств = Новый Массив;
	ВидыСчетовДенежныхСредств.Добавить(Перечисления.ВидыСчетовРеглУчета.ДенежныеСредства);
	Возврат ВидыСчетовДенежныхСредств;
	
КонецФункции

// Возвращает список видов счетов, применяющихся для счетов "ПорядокОтраженияПроизводства"
// Возвращаемое значение:
//	Массив - массив значений типа ПеречислениеСсылка.ВидыСчетовРеглУчета;
//
Функция ВидыСчетовПроизводства() Экспорт
	
	ВидыСчетовПроизводства = Новый Массив;
	ВидыСчетовПроизводства.Добавить(Перечисления.ВидыСчетовРеглУчета.Производство);
	Возврат ВидыСчетовПроизводства;
	
КонецФункции

// Возвращает список видов счетов, применяющихся для счетов "ВидыПодарочныхСертификатов" и "ПорядокОтраженияПодарочныхСертификатов"
// Возвращаемое значение:
//	Массив - массив значений типа ПеречислениеСсылка.ВидыСчетовРеглУчета;
//
Функция ВидыСчетовПодарочныхСертификатов() Экспорт
	
	ВидыСчетовПодарочныхСертификатов = Новый Массив;
	ВидыСчетовПодарочныхСертификатов.Добавить(Перечисления.ВидыСчетовРеглУчета.РасчетыПоПодарочнымСертификатам);
	Возврат ВидыСчетовПодарочныхСертификатов;
	
КонецФункции

// Возвращает список видов счетов, применяющихся для счетов "КатегорииЭксплуатации" и "ПорядокОтраженияТМЦВЭксплуатации"
// Возвращаемое значение:
//	Массив - массив значений типа ПеречислениеСсылка.ВидыСчетовРеглУчета;
//
Функция ВидыСчетовТМЦВЭксплуатации() Экспорт
	
	ВидыСчетовТМЦВЭксплуатации = Новый Массив;
	ВидыСчетовТМЦВЭксплуатации.Добавить(Перечисления.ВидыСчетовРеглУчета.ТМЦВЭксплуатации);
	ВидыСчетовТМЦВЭксплуатации.Добавить(Перечисления.ВидыСчетовРеглУчета.ТМЦВЭксплуатацииЗаБалансом);
	Возврат ВидыСчетовТМЦВЭксплуатации;
	
КонецФункции

#КонецОбласти

#КонецЕсли
